Revit 2027 API
PushButton.AssemblyName Property
The assembly path of the button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AssemblyName { get; set; }
Public Property AssemblyName As String
	Get
	Set
public:
property String^ AssemblyName {
	String^ get ();
	void set (String^ value);
}
member AssemblyName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException | Thrown when setting the value to null.
ArgumentException | Thrown when setting the value to an empty string.
InvalidOperationException | Thrown when setting the value to a ToggleButton which is not initialized with an external command.
Remarks
The path of the assembly which contains the corresponding external command.
See Also
Reference
PushButton Class
Autodesk.Revit.UI Namespace